<template>
  <v-container
    style="height:100%;"
    class="py-12 my-12"
  >
    <v-row
      justify="center"
      align="center"
    >
      <v-col
        cols="12"
        xl="8"
      >
        <h1>利用規約</h1>
        <p>最終更新日：2020/10/4</p>

        <pre style="text-align:left;">
<v-list color="#36393F">
この利用規約（以下，「本規約」といいます。）は，ディスコード速報運営（以下，「当運営」といいます。）がこのウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。

<v-list-item>
<v-list-item-subtitle>第1条（適用）</v-list-item-subtitle>
</v-list-item>
本規約は，ユーザーと当運営との間の本サービスの利用に関わる一切の関係に適用されるものとします。
当運営は本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。
本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。

<v-list-item>
<v-list-item-subtitle>第2条（利用登録）</v-list-item-subtitle>
</v-list-item>
本サービスにおいては，登録希望者が本規約に同意の上，ログインをした時点で利用登録が完了するものとします。
当運営は，利用登録の申請者に以下の事由があると判断した場合，登録の削除,ブロックすることがあり，その理由については一切の開示義務を負わないものとします。
本規約に違反したことがある者からの申請である場合
その他，当運営が利用登録を相当でないと判断した場合

<v-list-item>
<v-list-item-subtitle>第3条（禁止事項）</v-list-item-subtitle>
</v-list-item>
ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。

法令または公序良俗に違反する行為
犯罪行為に関連する行為
当運営，本サービスの他のユーザー，または第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
当運営のサービスの運営を妨害するおそれのある行為
他のユーザーに関する個人情報等を収集または蓄積する行為
不正アクセスをし，またはこれを試みる行為
他のユーザーに成りすます行為
当運営のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為
当運営，本サービスの他のユーザーまたは第三者の知的財産権，肖像権，プライバシー，名誉その他の権利または利益を侵害する行為
以下の表現を含み，または含むと当運営が判断する内容を本サービス上に投稿し，または送信する行為
過度に暴力的な表現
露骨な性的表現
人種，国籍，信条，性別，社会的身分，門地等による差別につながる表現
自殺，自傷行為，薬物乱用を誘引または助長する表現
その他反社会的な内容を含み他人に不快感を与える表現
以下を目的とし，または目的とすると当運営が判断する行為
営業，宣伝，広告，勧誘，その他営利を目的とする行為（当運営の認めたものを除きます。）
他のユーザーに対する嫌がらせや誹謗中傷を目的とする行為
当運営，本サービスの他のユーザー，または第三者に不利益，損害または不快感を与えることを目的とする行為
宗教活動または宗教団体への勧誘行為
その他，当運営が不適切と判断する行為
<a href="https://discord.com/guidelines">Discordコミュニティガイドライン</a>に反する行為

<v-list-item>
<v-list-item-subtitle>第4条（本サービスの提供の停止等）</v-list-item-subtitle>
</v-list-item>
当運営は，いつでもユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。

<v-list-item>
<v-list-item-subtitle>第5条（著作権）</v-list-item-subtitle>
</v-list-item>
ユーザーは，自ら著作権等の必要な知的財産権を有するか，または必要な権利者の許諾を得た文章，画像や映像等の情報に関してのみ，本サービスを利用し，投稿ないしアップロードすることができるものとします。
ユーザーが本サービスを利用して投稿ないしアップロードした文章，画像，映像等の著作権については，当該ユーザーその他既存の権利者に留保されるものとします。
ただし，当運営は，本サービスを利用して投稿ないしアップロードされた文章，画像，映像等について，本サービスの改良，品質の向上，または不備の是正等ならびに本サービスの周知宣伝等に必要な範囲で利用できるものとし，ユーザーは，この利用に関して，著作者人格権を行使しないものとします。
前項本文の定めるものを除き，本サービスおよび本サービスに関連する一切の情報についての著作権およびその他の知的財産権はすべて当運営または当運営にその利用を許諾した権利者に帰属し，ユーザーは無断で複製，譲渡，貸与，翻訳，改変，転載，公衆送信（送信可能化を含みます。），伝送，配布，出版，営業使用等をしてはならないものとします。
ユーザの投稿により第三者の権利やプライバシーの侵害等の紛争が発生した場合は、投稿したユーザの責任と費用で解決する必要があります。

<v-list-item>
<v-list-item-subtitle>第6条（利用制限および登録抹消）</v-list-item-subtitle>
</v-list-item>
当運営は事前の通知なく，投稿データを削除し，ユーザーに対して本サービスの全部もしくは一部の利用を制限しまたはユーザーとしての登録を抹消することができるものとします。

<v-list-item>
<v-list-item-subtitle>第7条（保証の否認および免責事項）</v-list-item-subtitle>
</v-list-item>
当運営は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
当運営は，本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。
当運営は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。

<v-list-item>
<v-list-item-subtitle>第8条（サービス内容の変更等）</v-list-item-subtitle>
</v-list-item>
当運営は，ユーザーに通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。

<v-list-item>
<v-list-item-subtitle>第9条（利用規約の変更）</v-list-item-subtitle>
</v-list-item>
当運営は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，当該ユーザーは変更後の規約に同意したものとみなします。

<v-list-item>
<v-list-item-subtitle>第10条（個人情報の取扱い）</v-list-item-subtitle>
</v-list-item>
当運営は，本サービスの利用によって取得する個人情報については，当運営「<nuxt-link to="/privacy">プライバシーポリシー</nuxt-link>」に従い適切に取り扱うものとします。

</v-list>
</pre>

        <v-subheader class="float-right pb-12 mb-12">
          以上
        </v-subheader>
      </v-col>
    </v-row>
    <Footer />
  </v-container>
</template>

<script>
import Footer from '@/components/Footer.vue'
export default {
  components:{
    Footer
  },
  head () {
    return {
      title: '利用規約'
    }
  }
}
</script>

<style>
pre {
  overflow: auto;
  white-space: pre-wrap;
  word-wrap: break-word;
}
</style>